//------------------------------------------------------------------------------
/// @file
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  Copyright (c) 2019 HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください。
//------------------------------------------------------------------------------

#pragma once

//------------------------------------------------------------------------------
namespace hpc {

/// 整数の2次元座標。
class Point
{
public:
    /// @name コンストラクタ
    //@{
    Point();
    Point(int aX, int aY);
    //@}

    /// @name メンバ変数
    //@{
    int x;
    int y;
    //@}
};

} // namespace
// EOF
